snlkuharlocal/src/DataProcessors/ПроведениеДокументов/ПроведениеДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПроведениеДокументов</name>
  <attributes>
    <name>фПакетныйРежим</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументГраницы</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата1</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата2</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Индикатор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ГП</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаГраницы</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументГраницы</name>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ПервыйДокументЗаГП</name>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаПроведения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

snlkuharlocal/src/AccumulationRegisters/ОстаткиТМЦ/ОстаткиТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТМЦ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.СтатьиЗатрат</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Оборот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДК</name>
    <type>
      <types>CatalogRef.ДисконтныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктДоставки</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОборотБезСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОборотУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОборотБезСкидкиУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Амортизация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Акция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/AccumulationRegisters/Профит/Профит.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Профит</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВидНоменклатуры</name>
    <type>
      <types>EnumRef.ВидыНоменклаутры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/AccumulationRegisters/Взаиморасчеты/Взаиморасчеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Взаиморасчеты</name>
  <resources>
    <name>СуммаВал</name>
    <comment>Сумма в рублях</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <comment>Сумма в валюте расчетов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата_НачалаЗадолженности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Документ_ЗакрытогоПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УИД_СтрокиПлатежа</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/AccumulationRegisters/ДенежныеСредства/ДенежныеСредства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДенежныеСредства</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Кассы</types>
      <types>String</types>
      <types>CatalogRef.Контрагенты</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРасходов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Субзатрата</name>
    <type>
      <types>CatalogRef.СубЗатраты</types>
    </type>
  </attributes>
  <dimensions>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.Кассы</types>
      <types>CatalogRef.БанковскиеСчета</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/AccumulationRegisters/Затраты/Затраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Затраты</name>
  <resources>
    <name>СуммаУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Кассы</types>
      <types>CatalogRef.БанковскиеСчета</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРасходов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентЛогистика</name>
    <type>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>КаналСбыта</name>
    <type>
      <types>CatalogRef.КаналСбыта</types>
    </type>
  </attributes>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КапитальныеЗатраты</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СубЗатрата</name>
    <type>
      <types>CatalogRef.СубЗатраты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/AccumulationRegisters/ТоварыВПути/ТоварыВПути.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыВПути</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаПоставщика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/AccumulationRegisters/Амортизация/Амортизация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Амортизация</name>
  <resources>
    <name>Амортизация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОС</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Enums/Отгружен/Отгружен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Отгружен</name>
  <enumValues>
    <name>Отгружен</name>
  </enumValues>
  <enumValues>
    <name>Резерв</name>
  </enumValues>
  <enumValues>
    <name>РезервТранзит</name>
    <comment>Резерв транзит</comment>
  </enumValues>
  <enumValues>
    <name>ОтгруженТранзит</name>
    <comment>Отгружен на транзит</comment>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/DataProcessors/ПроведениеДокументов/ObjectModule.bsl
Перем ЗапросПоДвижениям;
//крохин начало 07.11.2011
//ещё один контроль перед проведением
Перем ЗапросКонтрольБаланса;
//крохин конец 07.11.2011

Функция ЕстьРасхожденияВСписании(Ссылка)
	Если Ссылка.Отгружен=Перечисления.Отгружен.Резерв ИЛИ Ссылка.Отгружен=Перечисления.Отгружен.РезервТранзит Тогда
		Возврат Ложь;	
	КонецЕсли;
	//
	ЗапросПоДвижениям.УстановитьПараметр("МоментВремени",		Новый МоментВремени(Ссылка.Дата,Ссылка.Ссылка));
	ЗапросПоДвижениям.УстановитьПараметр("Ссылка",				Ссылка);
	ЗапросПоДвижениям.УстановитьПараметр("Склад",				Ссылка.Склад);
	ЗапросПоДвижениям.УстановитьПараметр("СписокНомекнлатуры",	Ссылка.Товары.ВыгрузитьКолонку("Номенклатура"));
			
	Результат=ЗапросПоДвижениям.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		//Если фОтладка Тогда
		//	Сообщить(Ссылка);			
		//	ВыборкаОтклонений=Результат.Выбрать();
		//	Пока ВыборкаОтклонений.Следующий() Цикл
		//		Сообщить(""+ВыборкаОтклонений.Номенклатура+" "+ВыборкаОтклонений.ЦенаОстатка+" "+ВыборкаОтклонений.ЦенаСписания);				
		//	КонецЦикла;			
		//КонецЕсли;	
	Возврат Истина;	
	//крохин начало 07.11.2011
		//+ контроль баланса
    Иначе
	ЗапросКонтрольБаланса.УстановитьПараметр("Регистратор",Ссылка);
	Результат = ЗапросКонтрольБаланса.Выполнить();
	Если НЕ Результат.Пустой() Тогда
	Возврат Истина;		
	КонецЕсли;
	//крохин конец 07.11.2011
	КонецЕсли; 
	
	
	Возврат Ложь;
КонецФункции //ЕстьРасхожденияВСписании(Ссылка)

Функция НужноПерепроводитьДокумент(Ссылка)
	//крохин начало 09.11.2011
	//пока не требуется ничего ускорять
	Возврат Истина;
	//крохин конец 09.11.2011
	Если ТипЗнч(Ссылка)=Тип("ДокументСсылка.РасходнаяНакладная")  ИЛИ ТипЗнч(Ссылка)=Тип("ДокументСсылка.Перемещение") Тогда		
		Если ТипЗнч(Ссылка)=Тип("ДокументСсылка.РасходнаяНакладная") И Ссылка.ОтгрузкаКомплектов Тогда
			Возврат Истина;		
		Иначе
			Возврат ЕстьРасхожденияВСписании(Ссылка);			
		КонецЕсли;		
	Иначе
		Возврат Истина;	
	КонецЕсли; 	
КонецФункции

//Ратманов
//Функция ПолучитьПервыйДокументЗаГП(Граница)
//	Запрос=Новый Запрос;
//	Запрос.Текст="
//	|ВЫБРАТЬ ПЕРВЫЕ 1
//	|	Регистратор
//	|ИЗ
//	|	Последовательность.Товары КАК Товары
//	|ГДЕ
//	|	МоментВремени>=&Граница
//	|   И Регистратор.Проведен
//	|   И IsNULL(Регистратор.Отгружен,ЗНАЧЕНИЕ(Перечисление.Отгружен.Отгружен))=ЗНАЧЕНИЕ(Перечисление.Отгружен.Отгружен)
//	|УПОРЯДОЧИТЬ ПО МоментВремени";	
//	
//	Запрос.УстановитьПараметр("Граница",Граница);	
//		
//    Выборка=Запрос.Выполнить().Выбрать();
//	Пока Выборка.Следующий() Цикл
//		Возврат Выборка.Регистратор;	
//	КонецЦикла;
//	
//	Возврат Неопределено;
//КонецФункции //ЕстьДокументыПослеГП(Склад,Граница)
Функция ПолучитьПервыйДокументЗаГП(Граница)
	Запрос=Новый Запрос;      
	
	Для каждого ДокПоследовательности Из Метаданные.Последовательности["Товары"].Документы Цикл
		ТекстДок = "
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Послед_Товары.Регистратор,Послед_Товары.МоментВремени
		|ИЗ
		|	Последовательность.Товары КАК Послед_Товары  
		|Внутреннее соединение Документ."+ДокПоследовательности.Имя+" Док По Док.Ссылка = Послед_Товары.Регистратор И Док.Проведен 
		|"+?(ДокПоследовательности.Реквизиты.Найти("Отгружен")=Неопределено,"","и Док.Отгружен=ЗНАЧЕНИЕ(Перечисление.Отгружен.Отгружен)")+"
		|ГДЕ
		|	Послед_Товары.МоментВремени>=&Граница
		|";   
		
		Если Запрос.Текст="" Тогда
			Запрос.Текст = Запрос.Текст+ТекстДок;
		Иначе
			Запрос.Текст = Запрос.Текст+"
			|Объединить
			|"+ТекстДок;
		КонецЕсли;	
	КонецЦикла;	
	
	Запрос.Текст="
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Регистратор
	|ИЗ
	|	("+Запрос.Текст+") Данные
	|УПОРЯДОЧИТЬ ПО МоментВремени";	
	
	Запрос.УстановитьПараметр("Граница",Граница);	
		
    Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Регистратор;	
	КонецЦикла;
	
	Возврат Неопределено;
КонецФункции //ЕстьДокументыПослеГП(Склад,Граница)
 
Функция ПолучитьГП() Экспорт
    ГП.Очистить();
	
	Граница=Последовательности.Товары.ПолучитьГраницу();
	
	СтрокаГП=ГП.Добавить();	
		
//	СтрокаГП.Склад				= Граница.Склад;
	СтрокаГП.ДатаГраницы		= Граница.Дата;
	СтрокаГП.ДокументГраницы	= Граница.Ссылка;
	
	Если НЕ ЗначениеЗаполнено(СтрокаГП.ДокументГраницы) Тогда
		Граница=Новый МоментВремени(Граница.Дата,Документы.РасходнаяНакладная.ПустаяСсылка());	
	КонецЕсли; 
	
	СтрокаГП.ПервыйДокументЗаГП	= ПолучитьПервыйДокументЗаГП(Граница);	
		
	Если СтрокаГП.ПервыйДокументЗаГП<>Неопределено И НЕ СтрокаГП.ПервыйДокументЗаГП.Пустая() Тогда
		СтрокаГП.ДатаНачалаПроведения = СтрокаГП.ПервыйДокументЗаГП.Дата;		
	КонецЕсли;		
	
	
	Дата1=ТекущаяДата();
	Дата2=ТекущаяДата();
	
	ГП.Сортировать("ДатаНачалаПроведения,ДатаГраницы");
	Для Каждого СтрокаГП Из ГП Цикл
		Если СтрокаГП.ПервыйДокументЗаГП<>Неопределено Тогда
			Дата1			=СтрокаГП.ДатаНачалаПроведения;
			ДокументГраницы	=СтрокаГП.ДокументГраницы;
			Прервать;
		КонецЕсли;	
	КонецЦикла;
КонецФункции

Процедура ПровестиДокументы_Старая(Форма=Неопределено) Экспорт

	Если фПакетныйРежим Тогда
		ПараметрыСеанса.ОтключитьЖурнализациюЗаписи	=Истина;	
		ПараметрыСеанса.ОтключитьКонтрольДЗР		=Истина;
		ПараметрыСеанса.ОтключитьКонтрольРезервов	=Истина;	
	КонецЕсли;	
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	Регистратор КАК Ссылка,	
	|	Период,
	|	МоментВремени КАК МоментВремени
	|ИЗ
	|	Последовательность.Товары КАК Товары
	|ГДЕ 
	|	Период >= &Дата1 И Период<=&Дата2
	|	И Регистратор.Проведен	
	|УПОРЯДОЧИТЬ ПО
	|	МоментВремени";
	
	Запрос.УстановитьПараметр("Дата1",Дата1);
	Запрос.УстановитьПараметр("Дата2",КонецДня(Дата2));
		
	Выборка=Запрос.Выполнить().Выбрать();
	
	Если Форма<>Неопределено Тогда
		Форма.ЭлементыФормы.Индикатор.МаксимальноеЗначение=Выборка.Количество();			
	КонецЕсли;
	
	Индикатор=0;
	
	Дата0	= Дата1;	
	Время0  = ТекущаяДата();
	
	Сч=0;
	
	ЗаписатьВЛог("Пакетное проведение","Начало обработки. Проведение с : "+Дата1+". Документ: "+ДокументГраницы,"Информация",Истина);
	
	ДокСсылка="";
	Пока Выборка.Следующий() Цикл
		#ЕСЛИ КЛИЕНТ ТОГДА
		ОбработкаПрерыванияПользователя();
		#КОНЕЦЕСЛИ
		
		Сообщить("Проведение: "+Выборка.Ссылка);
		ДокСсылка=Выборка.Ссылка;
		ДокОбъект=Выборка.Ссылка.ПолучитьОбъект();
		
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		Индикатор=Индикатор+1;
		
		Сч=Сч+1;
		
		Если НачалоДня(Дата0)<>НачалоДня(Выборка.Период) Тогда		
			ЗаписатьВЛог("Тайминг проведения","Период с : "+Дата0+" по "+Выборка.Период+". Кол-во документов: "+Сч+". Время обработки: "+Формат((ТекущаяДата()-Время0)/60,"ЧДЦ=1; ЧРГ=' '; ЧГ=3,0")+" мин.","Информация");
			
			Дата0	= Выборка.Период;
			Время0  = ТекущаяДата();
			Сч=0;
		КонецЕсли; 
	КонецЦикла; 
	
	Если Сч<>0 Тогда
		ЗаписатьВЛог("Тайминг проведения","Период с : "+Дата0+" по "+Дата2+". Кол-во документов: "+Сч+". Время обработки: "+Формат((ТекущаяДата()-Время0)/60,"ЧДЦ=1; ЧРГ=' '; ЧГ=3,0")+" мин.","Информация");
	КонецЕсли; 
	
	ЗаписатьВЛог("Пакетное проведение","Завершение обработки. Проведено по: "+ДокСсылка,"Информация",Истина);
	
	ПараметрыСеанса.ОтключитьЖурнализациюЗаписи	=Ложь;	
	ПараметрыСеанса.ОтключитьКонтрольДЗР		=Ложь;
	ПараметрыСеанса.ОтключитьКонтрольРезервов	=Ложь;	
КонецПроцедуры

Процедура ПровестиДокументы(Форма=Неопределено) Экспорт
	Если фПакетныйРежим Тогда
		ПараметрыСеанса.ОтключитьЖурнализациюЗаписи	=Истина;	
		ПараметрыСеанса.ОтключитьКонтрольДЗР		=Истина;
		ПараметрыСеанса.ОтключитьКонтрольРезервов	=Истина;
	КонецЕсли;	
	
	//крохин начало 15.12.2018
	//для проведения РКМ/КЦН в ЦО
	ПараметрыСеанса.ЗапущенаОбработка = Истина;
	//крохин конец 15.12.2018	
	
	//крохин начало 07.11.2011
//ещё один контроль перед проведением
 ЗапросКонтрольБаланса = Новый Запрос;
 ЗапросКонтрольБаланса.Текст = "ВЫБРАТЬ
                               |	ОстаткиТМЦ.Регистратор,
                               |	СУММА(ВЫБОР
                               |			КОГДА ОстаткиТМЦ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
                               |				ТОГДА 1
                               |			ИНАЧЕ -1
                               |		КОНЕЦ * ОстаткиТМЦ.Сумма) КАК Себестоимость
                               |ПОМЕСТИТЬ Остатки
                               |ИЗ
                               |	РегистрНакопления.ОстаткиТМЦ КАК ОстаткиТМЦ
                               |ГДЕ
                               |	ОстаткиТМЦ.Регистратор = &Регистратор
                               |
                               |СГРУППИРОВАТЬ ПО
                               |	ОстаткиТМЦ.Регистратор
                               |;
                               |
                               |////////////////////////////////////////////////////////////////////////////////
                               |ВЫБРАТЬ
                               |	Профит.Регистратор,
                               |	СУММА(ВЫБОР
                               |			КОГДА Профит.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
                               |				ТОГДА 1
                               |			ИНАЧЕ -1
                               |		КОНЕЦ * Профит.Сумма) КАК Профит
                               |ПОМЕСТИТЬ РПрофит
                               |ИЗ
                               |	РегистрНакопления.Профит КАК Профит
                               |ГДЕ
                               |	Профит.Регистратор = &Регистратор
                               |
                               |СГРУППИРОВАТЬ ПО
                               |	Профит.Регистратор
                               |;
                               |
                               |////////////////////////////////////////////////////////////////////////////////
                               |ВЫБРАТЬ
                               |	Взаиморасчеты.Регистратор,
                               |	СУММА(ВЫБОР
                               |			КОГДА Взаиморасчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
                               |				ТОГДА 1
                               |			ИНАЧЕ -1
                               |		КОНЕЦ * Взаиморасчеты.СуммаУпр) КАК Долг
                               |ПОМЕСТИТЬ Взаиморасчеты
                               |ИЗ
                               |	РегистрНакопления.Взаиморасчеты КАК Взаиморасчеты
                               |ГДЕ
                               |	Взаиморасчеты.Регистратор = &Регистратор
                               |
                               |СГРУППИРОВАТЬ ПО
                               |	Взаиморасчеты.Регистратор
                               |;
                               |
                               |////////////////////////////////////////////////////////////////////////////////
                               |ВЫБРАТЬ
                               |	ДенежныеСредства.Регистратор,
                               |	СУММА(ВЫБОР
                               |			КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
                               |				ТОГДА 1
                               |			ИНАЧЕ -1
                               |		КОНЕЦ * ДенежныеСредства.СуммаУпр) КАК ДС
                               |ПОМЕСТИТЬ ДенежныеСредства
                               |ИЗ
                               |	РегистрНакопления.ДенежныеСредства КАК ДенежныеСредства
                               |ГДЕ
                               |	ДенежныеСредства.Регистратор = &Регистратор
                               |
                               |СГРУППИРОВАТЬ ПО
                               |	ДенежныеСредства.Регистратор
                               |;
                               |
                               |////////////////////////////////////////////////////////////////////////////////
                               |ВЫБРАТЬ
                               |	Затраты.Регистратор,
                               |	СУММА(ВЫБОР
                               |			КОГДА Затраты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
                               |				ТОГДА 1
                               |			ИНАЧЕ -1
                               |		КОНЕЦ * Затраты.СуммаУпр) КАК СуммаЗатрат
                               |ПОМЕСТИТЬ Затраты
                               |ИЗ
                               |	РегистрНакопления.Затраты КАК Затраты
                               |ГДЕ
                               |	Затраты.Регистратор = &Регистратор
                               |
                               |СГРУППИРОВАТЬ ПО
                               |	Затраты.Регистратор
                               |;
                               |
                               |////////////////////////////////////////////////////////////////////////////////
                               |ВЫБРАТЬ
                               |	ТоварыВПути.Регистратор,
                               |	СУММА(ВЫБОР
                               |			КОГДА ТоварыВПути.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
                               |				ТОГДА 1
                               |			ИНАЧЕ -1
                               |		КОНЕЦ * ТоварыВПути.Сумма) КАК ТоварВПути
                               |ПОМЕСТИТЬ ТоварыВПути
                               |ИЗ
                               |	РегистрНакопления.ТоварыВПути КАК ТоварыВПути
                               |ГДЕ
                               |	ТоварыВПути.Регистратор = &Регистратор
                               |
                               |СГРУППИРОВАТЬ ПО
                               |	ТоварыВПути.Регистратор
                               |;
                               |
                               |////////////////////////////////////////////////////////////////////////////////
                               |ВЫБРАТЬ
                               |	ТТ.Регистратор,
                               |	СУММА(ВЫБОР
                               |			КОГДА ТТ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
                               |				ТОГДА 1
                               |			ИНАЧЕ -1
                               |		КОНЕЦ * ТТ.Амортизация) КАК СуммаАмортизации
                               |ПОМЕСТИТЬ ТАмортизация
                               |ИЗ
                               |	РегистрНакопления.Амортизация КАК ТТ
                               |ГДЕ
                               |	ТТ.Регистратор = &Регистратор
                               |
                               |СГРУППИРОВАТЬ ПО
                               |	ТТ.Регистратор
                               |;
                               |
                               |////////////////////////////////////////////////////////////////////////////////
                               |ВЫБРАТЬ
                               |	Сводный.Регистратор,
                               |	СУММА(Сводный.Себестоимость) КАК Себестоимость,
                               |	СУММА(Сводный.Профит) КАК Профит,
                               |	СУММА(Сводный.Долг) КАК Долг,
                               |	СУММА(Сводный.ДС) КАК ДС,
                               |	СУММА(Сводный.Затраты) КАК Затраты,
                               |	СУММА(Сводный.ТоварВПути) КАК ТоварВПути,
                               |	СУММА(Сводный.СуммаАмортизации) КАК СуммаАмортизации,
                               |	СУММА(Сводный.Себестоимость) + СУММА(Сводный.Долг) + СУММА(Сводный.ДС) + СУММА(Сводный.Затраты) + СУММА(Сводный.ТоварВПути) - СУММА(Сводный.Профит) - СУММА(Сводный.СуммаАмортизации) КАК Дельта1
                               |ИЗ
                               |	(ВЫБРАТЬ
                               |		Остатки.Регистратор КАК Регистратор,
                               |		Остатки.Себестоимость КАК Себестоимость,
                               |		0 КАК Профит,
                               |		0 КАК Долг,
                               |		0 КАК ДС,
                               |		0 КАК Затраты,
                               |		0 КАК ТоварВПути,
                               |		0 КАК СуммаАмортизации
                               |	ИЗ
                               |		Остатки КАК Остатки
                               |	
                               |	ОБЪЕДИНИТЬ ВСЕ
                               |	
                               |	ВЫБРАТЬ
                               |		РПрофит.Регистратор,
                               |		0,
                               |		РПрофит.Профит,
                               |		0,
                               |		0,
                               |		0,
                               |		0,
                               |		0
                               |	ИЗ
                               |		РПрофит КАК РПрофит
                               |	
                               |	ОБЪЕДИНИТЬ ВСЕ
                               |	
                               |	ВЫБРАТЬ
                               |		Взаиморасчеты.Регистратор,
                               |		0,
                               |		0,
                               |		Взаиморасчеты.Долг,
                               |		0,
                               |		0,
                               |		0,
                               |		0
                               |	ИЗ
                               |		Взаиморасчеты КАК Взаиморасчеты
                               |	
                               |	ОБЪЕДИНИТЬ ВСЕ
                               |	
                               |	ВЫБРАТЬ
                               |		ДенежныеСредства.Регистратор,
                               |		0,
                               |		0,
                               |		0,
                               |		ДенежныеСредства.ДС,
                               |		0,
                               |		0,
                               |		0
                               |	ИЗ
                               |		ДенежныеСредства КАК ДенежныеСредства
                               |	
                               |	ОБЪЕДИНИТЬ ВСЕ
                               |	
                               |	ВЫБРАТЬ
                               |		Затраты.Регистратор,
                               |		0,
                               |		0,
                               |		0,
                               |		0,
                               |		Затраты.СуммаЗатрат,
                               |		0,
                               |		0
                               |	ИЗ
                               |		Затраты КАК Затраты
                               |	
                               |	ОБЪЕДИНИТЬ ВСЕ
                               |	
                               |	ВЫБРАТЬ
                               |		ТоварыВПути.Регистратор,
                               |		0,
                               |		0,
                               |		0,
                               |		0,
                               |		0,
                               |		ТоварыВПути.ТоварВПути,
                               |		0
                               |	ИЗ
                               |		ТоварыВПути КАК ТоварыВПути
                               |	
                               |	ОБЪЕДИНИТЬ ВСЕ
                               |	
                               |	ВЫБРАТЬ
                               |		ТАмортизация.Регистратор,
                               |		0,
                               |		0,
                               |		0,
                               |		0,
                               |		0,
                               |		0,
                               |		ТАмортизация.СуммаАмортизации
                               |	ИЗ
                               |		ТАмортизация КАК ТАмортизация) КАК Сводный
                               |
                               |СГРУППИРОВАТЬ ПО
                               |	Сводный.Регистратор
                               |
                               |ИМЕЮЩИЕ
                               |	СУММА(Сводный.Себестоимость) + СУММА(Сводный.Долг) + СУММА(Сводный.ДС) + СУММА(Сводный.Затраты) + СУММА(Сводный.ТоварВПути) - СУММА(Сводный.Профит) - СУММА(Сводный.СуммаАмортизации) <> 0";
//крохин конец 07.11.2011

	
	ЗапросПоДвижениям=Новый Запрос;
	ЗапросПоДвижениям.Текст="
	|ВЫБРАТЬ
	|	Номенклатура,
	|	КоличествоОстаток,
	|	СуммаОстаток,
	|	ВЫБОР КОГДА КоличествоОстаток<>0 ТОГДА ВЫРАЗИТЬ(СуммаОстаток/КоличествоОстаток КАК Число(19,2)) ИНАЧЕ 0 КОНЕЦ КАК ЦенаОстатка
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.Остатки(&МоментВремени,Склад = &Склад И Номенклатура В (&СписокНомекнлатуры))
	|;
	|ВЫБРАТЬ 
	|	Номенклатура,
	|	СУММА(Количество) 	КАК Количество,
	|	СУММА(Сумма)		КАК Сумма,
	|	ВЫБОР КОГДА СУММА(Количество)<>0 ТОГДА ВЫРАЗИТЬ(СУММА(Сумма)/СУММА(Количество) КАК Число(19,2)) ИНАЧЕ 0 КОНЕЦ КАК ЦенаСписания
	|ПОМЕСТИТЬ Списание
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ	
	|ГДЕ
	|	Регистратор=&Ссылка
	|	И Склад=&Склад
	|	И ВидДвижения=ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|СГРУППИРОВАТЬ ПО
	|	Номенклатура
	|;
	|ВЫБРАТЬ 
	|	Списание.Номенклатура КАК Номенклатура,
	|	ЦенаОстатка,
	|	ЦенаСписания
	|ИЗ
	|	Списание	
	|ПОЛНОЕ СОЕДИНЕНИЕ
	|	Остатки
	|ПО
	|	Списание.Номенклатура = Остатки.Номенклатура
	|ГДЕ
	|	(ЦенаОстатка-ЦенаСписания)>0.01 ИЛИ (ЦенаСписания-ЦенаОстатка)>0.01";
	
	//Ратманов
	//Запрос=Новый Запрос;
	//Запрос.Текст="
	//|ВЫБРАТЬ
	//|	Регистратор КАК Ссылка,	
	//|	Период,
	//|	МоментВремени КАК МоментВремени
	//|ИЗ
	//|	Последовательность.Товары КАК Товары
	//|ГДЕ 
	//|	Период >= &Дата1 И Период<=&Дата2
	//|	И Регистратор.Проведен	
	//|УПОРЯДОЧИТЬ ПО
	//|	МоментВремени";
	Запрос=Новый Запрос;  
	
	Для каждого ДокПоследовательности Из Метаданные.Последовательности["Товары"].Документы Цикл
		ТекстДок = "
		|ВЫБРАТЬ 
		|	Послед_Товары.Регистратор,Послед_Товары.Период,Послед_Товары.МоментВремени
		|ИЗ
		|	Последовательность.Товары КАК Послед_Товары  
		|Внутреннее соединение Документ."+ДокПоследовательности.Имя+" Док По Док.Ссылка = Послед_Товары.Регистратор И Док.Проведен 
		|ГДЕ
		|	Послед_Товары.Период между &Дата1 И &Дата2
		|";   
		
		Если Запрос.Текст="" Тогда
			Запрос.Текст = Запрос.Текст+ТекстДок;
		Иначе
			Запрос.Текст = Запрос.Текст+"
			|Объединить
			|"+ТекстДок;
		КонецЕсли;	
	КонецЦикла;	
	
	Запрос.Текст="
	|ВЫБРАТЬ
	|	Регистратор КАК Ссылка,	
	|	Период КАК Период,	
	|	МоментВремени КАК МоментВремени
	|ИЗ
	|	("+Запрос.Текст+") КАК Товары
	|УПОРЯДОЧИТЬ ПО
	|	МоментВремени";
	
	
	Запрос.УстановитьПараметр("Дата1",Дата1);
	Запрос.УстановитьПараметр("Дата2",КонецДня(Дата2));
		
	Выборка=Запрос.Выполнить().Выбрать();
	
	Если Форма<>Неопределено Тогда
		Форма.ЭлементыФормы.Индикатор.МаксимальноеЗначение=Выборка.Количество();			
	КонецЕсли;
	
	Индикатор=0;
	
	Дата0	= Дата1;	
	Время0  = ТекущаяДата();
	
	Сч=0;
	ПроведеноДокументов=0;
	ПропущеноДокументов=0;
	
	ЗаписатьВЛог("Пакетное проведение","Начало обработки. Проведение с : "+Дата1+". Документ: "+ДокументГраницы,"Информация",Истина);
	
	ДокСсылка="";
	Пока Выборка.Следующий() Цикл
		#ЕСЛИ КЛИЕНТ ТОГДА
		ОбработкаПрерыванияПользователя();
		#КОНЕЦЕСЛИ	
		
		Нужно=НужноПерепроводитьДокумент(Выборка.Ссылка);
		Если Нужно Тогда
			#ЕСЛИ КЛИЕНТ ТОГДА
			Сообщить("Проведение: "+Выборка.Ссылка);
			#КОНЕЦЕСЛИ
			ДокСсылка=Выборка.Ссылка;
			ДокОбъект=Выборка.Ссылка.ПолучитьОбъект();
			
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
			ПроведеноДокументов=ПроведеноДокументов+1;
		Иначе
//			Сообщить("Пропуск: "+Выборка.Ссылка);
			ПропущеноДокументов=ПропущеноДокументов+1;			
		КонецЕсли; 
		
		Последовательности.Товары.УстановитьГраницу(Выборка.МоментВремени);	
		Индикатор=Индикатор+1;
		
		Сч=Сч+1;
		
		Если НачалоДня(Дата0)<>НачалоДня(Выборка.Период) Тогда		
			ЗаписатьВЛог("Тайминг проведения","Период с : "+Дата0+" по "+Выборка.Период+". Кол-во документов: "+Сч+". Проведено: "+ПроведеноДокументов+", пропущено: "+ПропущеноДокументов+". Время обработки: "+Формат((ТекущаяДата()-Время0)/60,"ЧДЦ=1; ЧРГ=' '; ЧГ=3,0")+" мин.","Информация");
			
			Дата0	= Выборка.Период;
			Время0  = ТекущаяДата();
			Сч=0;
		КонецЕсли; 
	КонецЦикла; 
	
	Если Сч<>0 Тогда
		ЗаписатьВЛог("Тайминг проведения","Период с : "+Дата0+" по "+Дата2+". Кол-во документов: "+Сч+". Время обработки: "+Формат((ТекущаяДата()-Время0)/60,"ЧДЦ=1; ЧРГ=' '; ЧГ=3,0")+" мин.","Информация");
	КонецЕсли; 
	
	ЗаписатьВЛог("Пакетное проведение","Завершение обработки. Проведено по: "+ДокСсылка,"Информация",Истина);
	
	ПараметрыСеанса.ОтключитьЖурнализациюЗаписи	=Ложь;	
	ПараметрыСеанса.ОтключитьКонтрольДЗР		=Ложь;
	ПараметрыСеанса.ОтключитьКонтрольРезервов	=Ложь;	
	//крохин начало 15.12.2018
	//для проведения РКМ/КЦН в ЦО
	//крохин начало 16.08.2019
	//опечатка, по окончании обработки галку надо снять. Иначе франчайзи не смогут заполнять цены в ПРМ
	//ПараметрыСеанса.ЗапущенаОбработка = Истина;
	ПараметрыСеанса.ЗапущенаОбработка = Ложь;
	//крохин конец 16.08.2019
	//крохин конец 15.12.2018	
	
КонецПроцедуры
